<template>
	<div>
		<van-popup v-model="bool" position="right" class="poup" :style="{ height: '100%' ,width:'100%'}">
			<h2> 风险披露声明</h2>
			<span @click="fn()" style="position: absolute;right: .1rempx;top: .3rem;">
				<van-icon name="cross" color="#8a9097" size="30px" /></span>
			<div class="p">
				本交易风险披露和免责声明应与CR Wisdom平台
				<span @click="fn()" style="color:#306ce8;">
					<<用户使用协议>>
				</span>
				的服务条款一起阅读。简单来讲，我们希望当您在我们的平台上使用服务时能够理解相关重要的风险和合规事宜。
			</div>
			<h3>第一条：目的</h3>
			<div class="p">
				为了维护CR
				Wisdom平台合法合规可持续发展，我们建立并实施了一系列的反洗钱、反恐怖融资和贸易与经济制裁计划（"反洗钱/反恐融资/制裁计划"或"计划"）。我们致力于推进合法、透明的商业活动，并在用户、监管机构和数字资产行业中保持一个良好的商业声誉。
			</div>
			<div class="p">
				本风险提示书旨在向会员投资者揭示数字资产衍生品交易的投资风险，并且帮助投资者评估和确定自身的能力。
			</div>
			<div class="p">
				鉴于投资风险的存在，在确认本协议及进行现货交易或者合约交易前，投资者应该仔细阅读本风险提示书，必须确保自己理解有关现货或者合约交易的性质、规则，并依据自身的投资经验、目标、财务状况、承担风险的能力等自行决定是否参与现货或者合约交易。
			</div>
			<h3>第二条：业务模式</h3>
			<div class="p">
				CR Wisdom是一家全球性的数字资产量化交易技术服务平台，交易者使用CR Wisdom平台技术在数字交易市场进行量化交易。为清楚起见，买方和卖方彼此之间进行交易，而CR
				Wisdom平台不参与到实际交易中，不触碰交易者任何资金。
			</div>
			<div class="p">
				用户可以下载注册登陆CR Wisdom生态APP平台，以获得相关技术服务。 交易风险披露：数字资产交易有巨大风险。交易或持有数字资产的损失风险可能巨大。因此，您应根据您的财务状况仔细考虑您是否适合进行交易。
			</div>
			<div class="p">
				适合的投资者，使用CR
				Wisdom量化系统交易，数字资产衍生品交易具有高杠杆性和高风险性，仅适合专业投资机构或投资经验丰富的人士，或者能够充分理解有关于数字资产衍生品交易的一切风险，能承受因投资失误而造成账户资金部分或者全部损失的人士。
			</div>
		
			<h3>第三条：价格波动的风险</h3>
			<div class="p">
				数字货币衍生品作为一种特殊的具有投资价值的产品，其价格受多种因素的影响，价格波动大，会员投资者在实际操作中难以全面把握，因而存在出现投资失误的可能性，如果不能有效控制风险，则可能遭受较大的损失，投资者必须独自承担由此导致的一切损失。
			</div>
			<h3>第四条：交易风险</h3>
			<div class="p">
				数字货币量化交易有极高的风险。
			</div>
			<div class="p">
				CR Wisdom量化平台为用户提供API密钥接入数字货币交易服务，由于数字货币交易市场风险无法预测行情变化，因此用户注册CR Wisdom平台用户必须清晰认知自身经济能力与抗风险能力，并承诺自愿承担因此发生的一切后果。
			</div>
			<div class="p">
				CR Wisdom平台官方不会在任何场合对正式用户作出交易收益承诺和资金保本承诺和义务。CR Wisdom平台以其团队技术能力尽力为平台用户赚取正向收益，如出现行情波动变化和不可抗力因素变化，用户应理性自行承担投资风险。
			</div>
			<div class="p">
				数字货币市场是全新的、未经确认的，而且可能不会增长或贬损。目前，数字货币主要由投机者大量使用，零售和商业市场使用相对较少，因此数字货币价格易产生波动，并进而对数字货币投资产生不利影响。
			</div>
			<div class="p">
				数字货币市场没有像中国股市那样的涨跌停限制，同时交易是7X24小时开放的。数字货币由于筹码较少，价格易受到庄家控制，有可能出现一天价格涨几倍的情况，同时也可能出现一天内价格跌去一半的情况。
			</div>
			<div class="p">
				参与数字货币交易，用户应当自行控制风险，评估数字货币投资价值和投资风险，承担损失全部投资交易的经济风险。
			</div>
			<div class="p">
				因国家法律、法规和规范性文件的制定或者修改，导致数字货币的交易被暂停、或者禁止的，因此造成的经济损失全部由用户自行承担。
			</div>
			<h3>第五条：其他风险</h3>
			<div class="p p1">
				（1）当用户参与交易所合约交易使用高倍杠杆时，将会对用户自身和市场带来较大的风险，因此交易所为了维护市场稳定，对于使用高倍杠杆的用户持仓会进行监控，当交易所判断用户持仓有可能会对市场稳定造成较大影响时，将会采取相应的处理措施，包括但不限于沟通、揭示风险、强制减仓、强制平仓、撤单、提前交割结算等，并将给予用户书面解释。
			</div>
			<div class="p p1">
				（2）数字资产衍生品市场的衍生品交易规则，包括但不限于调整系数、到期日、产品规则等可根据交易所实际运营情况进行修改，交易所如因特殊情况需要对产品进行提前或延后交割，在官网公布或短信通知等方式履行告知义务后，用户需及时处理自身仓位，如因此造成的可能损失或者收益，皆由用户自身承担。
			</div>
			<div class="p p1">
				（3）重要提示
			</div>
			<div class="p">
				1、投资者在参与之前务必详尽地了解数字货币交易的基本知识和相关风险以及参与衍生品交易所有关的业务规则等。
			</div>
			<div class="p">
				2、本风险提示书上述风险事项仅为列举性质，未能详尽的列明有关数字资产衍生品交易的所有风险因素，投资者参与数字资产衍生品交易投资前，还应该认真对其它可能存在风险因素有所了解和掌握。
			</div>
			<div class="p">
				3、我们诚挚的希望和建议投资者，从风险承受能力等自身实际情况出发，慎重的决定是否参与此量化交易，合理地配置自己的数字资产。
			</div>
			<h3>第六条：监管环境</h3>
			<div class="p">
				我们了解到监管机构对数字资产的监管与规范采取了多种方式，包括将数字资产定义或归类为虚拟金融资产（马耳他）、可兑换虚拟货币（美国 FinCEN）或者虚拟商品（香港）。
			</div>
			<div class="p">
				我们认为数字资产交易所平台上提供的所有数字资产属于创新的另类资产类别，因此，数字资产不应该被称为钱或货币。
			</div>
			<div class="p">
				重要信息披露：数字资产不是钱或法定货币。在不同时期我们可能会对各政府机构所采取的监管方式有些见解; 但是，我们会一直全面遵守我们经营所在国家的规章制度。
			</div>
			<div class="p">
				同时，我们定期与监管机构和同行探讨监管数字资产业务的最佳方法。此外，CR Wisdom平台不接受某些客户，这是为了保持在市场上的良好声誉并确保一个强大的合规市场 。
			</div>
			<div class="p">
				我们遵守适用法规。作为良好的企业公民，执法部门可能会要求我们提供信息，并且如果法律允许执法调查以追查和阻止非法活动，我们将提供帮助。这也意味着我们的平台仅适用于守法的客户。
			</div>
			<div class="p">
				我们希望能为您提供服务，同时，我们也希望您在我们的平台上能够依法合法地行事。
			</div>
			<h3>第七条：反洗钱/反恐怖融资方案</h3>
		
			<div class="p">
				通过基于风险的多层次控制系统，我们设计了我们的反洗钱和反恐怖融资方案以合理防止洗钱和恐怖主义融资。
			</div>
			<div class="p">
				该方案的第一层包括严格的用户身份识别程序，包括验证个人和 企业用户的身份。除了获得身份证明文件外，我们还向非自然人用户取得其机构受益所有人/自然人的信息，这是符合国际标准的。
			</div>
			<div class="p">
				第二层包括基于风险的系统控制，以保证额外的客户尽职调查得以执行。我们也可以酌情在其他名单中进行筛选，以保护我们的声誉和客户。
			</div>
			<div class="p">
				第三层包括持续监控可疑活动。如果我们怀疑或有理由怀疑存在可疑交易活动，我们将酌情向当地监管机构提交可疑交易活动报告。通常，可疑交易与客户已知的合法业务或个人日常交易活动不一致。
			</div>
			<div class="p">
				以上是我们合规计划的主要组成部分。然而，这些多层次风控系统的最重要的纽带是我们的领导团队和员工，包括执行培训、监督并形成良好合规文化的反洗钱/风控人员。
			</div>
			<button class="changebton" @click="fn" style="background: #2167ff;">我已阅读并了解</button>
		</van-popup>
	</div>
</template>

<script>
	export default{
		props:['bool'],
		data(){
			return{
			}
		},
		created() {
		},
		methods:{
			fn(){
				this.$emit('func', this.bool)
			}
		}
	}
</script>

<style scoped>
	h2 {
		text-align: center;
		margin: 10px 0;
		color: rgb(0, 27, 49);
		font-size: 18px;
		font-weight: 550;
	}
	
	h4 {
		margin: 0px 0 5px 0;
		color: rgb(0, 27, 49);
		text-align: center;
		font-size: 16px;
	}
	
	.p {
		padding: 0 .28rem;
		text-indent: 24px;
		color: rgb(138, 144, 151);
		font-size: 14px;
	}
	
	.p1 {
		text-indent: 0px;
	}
	
	h3 {
		margin: 4px 0;
		padding: 0 .28rem;
		font-weight: 550;
		font-size: 16px;
		color: rgb(0, 27, 49);
	}
	
	h5 {
		color: rgb(138, 144, 151);
		padding: 0 .28rem;
		font-size: 16px;
		margin: 0px 0 2px 0;
	}
</style>

